Appiko/nrf5x-firmware/application/light_nvmc_logger/light_nvm_ble.c
/*
 *  light_nvm_testing_ble.c : BLE Support file for light_nvm6D application 
 *  Copyright (C) 2019  Appiko
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *  
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

#include "light_nvm_ble.h"

#include "nrf_nvic.h"
#include "ble.h"
#include "nrf_sdm.h"
#include "app_error.h"
#include "boards.h"
#include "stddef.h"
#include "common_util.h"
#include "nrf_util.h"
#include "log.h"
#include "evt_sd_handler.h"
#include "string.h"
#include "hal_nop_delay.h"

/**< Name of device, to be included in the advertising data. */

#define DEVICE_NAME_CHAR           'A','C','C','E'
const uint8_t device_name[] = { DEVICE_NAME_CHAR };


/** Complete 128 bit UUID of the SensePi service
 * 3c73dc70-07f5-480d-b066-837407fbde0a */
#define BTDONGLE_UUID_COMPLETE        0x0a, 0xde, 0xfb, 0x07, 0x74, 0x83, 0x66, 0xb0, 0x0d, 0x48, 0xf5, 0x07, 0x70, 0xdc, 0x73, 0x3c

/** The 16 bit UUID of the BT Dongle service */
#define BTDONGLE_UUID_SERVICE         0xdc70

/** The 16 bit UUID of the read-only System Info characteristic */
#define BTDONGLE_UUID_SYSINFO         0xdc71
/** The 16 bit UUID of the read-write Config characteristic */
#define BTDONGLE_UUID_CONFIG          0xdc72

#define NOTIFY_UUID_COMPLETE        0x0a, 0xde, 0xfb, 0x07, 0x74, 0x83, 0x66, 0xb0, 0x0d, 0x48, 0xf5, 0x07, 0x50, 0xdc, 0x73, 0x3c

/** The 16 bit UUID of the BT Dongle service */
#define NOTIFY_UUID_SERVICE         0xdc50

/** The 16 bit UUID of the read-only System Info characteristic */
#define NOTIFY_UUID_SYSINFO         0xdc51
/** The 16 bit UUID of the read-write Config characteristic */
#define NOTIFY_UUID_CONFIG          0xdc52

/**< Interval between advertisement packets (0.5 seconds). */
#define ADVERTISING_INTERVAL       MSEC_TO_UNITS(500, UNIT_0_625_MS)
/**< Minimum acceptable connection interval (0.2 seconds). */
#define MIN_CONN_INTERVAL          MSEC_TO_UNITS(200, UNIT_1_25_MS)
/**< Maximum acceptable connection interval (0.5 second). */
#define MAX_CONN_INTERVAL          MSEC_TO_UNITS(500, UNIT_1_25_MS)
/**< Slave latency (number of skippable conn events by the slave). */
#define SLAVE_LATENCY              0
/**< Connection supervisory timeout (4 seconds). */
#define CONN_SUP_TIMEOUT           MSEC_TO_UNITS(4000, UNIT_10_MS)


#define APP_ADV_DATA   {                                        \
                       0x02, BLE_GAP_AD_TYPE_FLAGS, BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,    \
                       sizeof(device_name) + 1, BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME, DEVICE_NAME_CHAR,   \
                       0x11, BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE, BTDONGLE_UUID_COMPLETE     \
                   }

#define APP_SCAN_RSP_DATA  {                                        \
                           0x02, BLE_GAP_AD_TYPE_TX_POWER_LEVEL, 0   ,     \
                           0x0B, BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME,  \
                           'L', 'i','g', 'h', 't', ' ' , 'L', 'o', 'g',' ',   \
                           0x04, BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0 ,  0 , 0 \
                           }


uint8_t adv_data[] =  APP_ADV_DATA ;
/** Handle to specify the advertising state to the soft device */
uint8_t h_adv;

/** Handle to specify the connection state to the soft device */
uint16_t h_conn;

/** Handle to specify the attribute of the BT Dongle service */
uint16_t h_light_nvm_service;
uint16_t h_light_notify_service;

/** Handle to specify the attribute of the characteristic with
 * the system information containing @ref light_nvm_dev_info*/
ble_gatts_char_handles_t h_status_byte;
ble_gatts_char_handles_t h_notify_byte;

/** Handle to specify the attribute of the characteristic with the
 * configuration parameters which are specified @ref light_nvm_config_t */
//ble_gatts_char_handles_t h_config_char;

///Called everytime the radio is switched off as per the
/// radio notification by the SoftDevice

volatile bool bluetooth_status = false;
void SWI1_IRQHandler(void)
{
//    log_printf("radio going down\n");
}

void (* connected_callback) (void);
void (* disconnected_callback) (void);

/**
 * @brief Handler which will address the BLE related events
 *  generated by the SoftDevice for BLE related activities.
 *  The event is passed on to the application for its activities.
 * @param evt The pointer to the buffer containing all the data
 *  related to the event
 */
static void ble_evt_handler(ble_evt_t * evt)
{
    uint32_t err_code;
    log_printf("BLE Event : %d\n", evt->header.evt_id);
    switch(evt->header.evt_id)
    {
    case BLE_GAP_EVT_ADV_SET_TERMINATED:
        break;
    case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        log_printf("Here it stoped\n");
        break;
        
    case BLE_GAP_EVT_CONNECTED:
        h_conn = evt->evt.gap_evt.conn_handle;
        connected_callback ();
        break;
    case BLE_GAP_EVT_DISCONNECTED:
        h_conn = BLE_CONN_HANDLE_INVALID;
        bluetooth_status = false;
        disconnected_callback ();
        light_nvm_ble_adv_start(connected_callback, disconnected_callback);

//        sd_softdevice_disable ();
        break;
    case BLE_GATTS_EVT_WRITE:
        break;
    case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
    {
        uint16_t mtu_val = BLE_GATT_ATT_MTU_DEFAULT;
        err_code = sd_ble_gatts_exchange_mtu_reply(h_conn, mtu_val);
        APP_ERROR_CHECK(err_code);
        break;
    }
    case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
    {
        ble_gap_phys_t const phys = {
            .rx_phys = BLE_GAP_PHY_AUTO,
            .tx_phys = BLE_GAP_PHY_AUTO,
        };

        err_code = sd_ble_gap_phy_update(h_conn, &phys);
        APP_ERROR_CHECK(err_code);
        break;
    }
    case BLE_GAP_EVT_PHY_UPDATE:
    {
        log_printf("Tx_get : %x  Rx_get : %x  Status : %x\n",
                   evt->evt.gap_evt.params.phy_update.tx_phy, 
                   evt->evt.gap_evt.params.phy_update.rx_phy,
                   evt->evt.gap_evt.params.phy_update.status);
        break;
    }
    }

}

/**
 * @brief Handler which will address all the SoC related events
 *  generated by the SoftdDevice.
 * @param evt_id The ID of the SoC event generated
 */
static void soc_evt_handler(uint32_t evt_id)
{
    log_printf("soc evt %x\n", evt_id);
}

void light_nvm_ble_disconn(void)
{
    if(h_conn != BLE_CONN_HANDLE_INVALID)
    {
        uint32_t err_code;
        err_code = sd_ble_gap_disconnect(h_conn,
                BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
    }
}

void light_nvm_ble_stack_init()
{
    uint32_t err_code;
    const nrf_clock_lf_cfg_t cfg = BOARD_LFCLKSRC_STRUCT;
    
    
    err_code = sd_softdevice_enable(&cfg, app_error_fault_handler);
    APP_ERROR_CHECK(err_code);
    
    uint32_t app_ram_start = 0x20001c00;
    log_printf("Init %x", app_ram_start);
    err_code = sd_ble_enable(&app_ram_start);
    log_printf(" RAM needed %x\n", app_ram_start);
    APP_ERROR_CHECK(err_code);

    evt_sd_handler_init(ble_evt_handler, soc_evt_handler);

    //So that the application wakes up after every radio activity
    err_code = sd_radio_notification_cfg_set(
            NRF_RADIO_NOTIFICATION_TYPE_INT_ON_INACTIVE,
            NRF_RADIO_NOTIFICATION_DISTANCE_NONE);
    APP_ERROR_CHECK(err_code);

    // Initialize Radio Notification software interrupt
    err_code = sd_nvic_ClearPendingIRQ(SWI1_IRQn);
    APP_ERROR_CHECK(err_code);

    err_code = sd_nvic_SetPriority(SWI1_IRQn, APP_IRQ_PRIORITY_LOWEST);
    APP_ERROR_CHECK(err_code);

    err_code = sd_nvic_EnableIRQ(SWI1_IRQn);
    APP_ERROR_CHECK(err_code);

    h_conn = BLE_CONN_HANDLE_INVALID;
}

void light_nvm_ble_service_init(void)
{
    uint32_t   err_code;
    ble_uuid_t ble_uuid;
    uint8_t uuid_type;

    /**** Create the BT Dongle service *****/
    ble_uuid128_t base_uuid = {{BTDONGLE_UUID_COMPLETE}};
    err_code = sd_ble_uuid_vs_add(&base_uuid, &uuid_type);
    APP_ERROR_CHECK(err_code);

    ble_uuid.type = uuid_type;
    ble_uuid.uuid = BTDONGLE_UUID_SERVICE;

    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
            &ble_uuid, &h_light_nvm_service);
    APP_ERROR_CHECK(err_code);

    /**** Create the read-only characteristic *****/
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_t attr_char_value;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_md_t attr_md;

	memset(&cccd_md, 0, sizeof(cccd_md));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN (&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN (&cccd_md.write_perm);
    cccd_md.vloc = BLE_GATTS_VLOC_STACK;

    memset(&char_md, 0, sizeof(char_md));

    char_md.char_props.read = 1;
    char_md.char_props.notify = 1;
    char_md.p_char_user_desc = NULL;
    char_md.p_char_pf = NULL;
    char_md.p_user_desc_md = NULL;
    char_md.p_cccd_md = &cccd_md;
    char_md.p_sccd_md = NULL;

    ble_uuid.type = uuid_type;
    ble_uuid.uuid = (BTDONGLE_UUID_SYSINFO);

    memset(&attr_md, 0, sizeof(attr_md));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attr_md.write_perm);
    attr_md.vloc = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen = 0;

    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid = &ble_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len = sizeof(mod_ble_data_t);
    attr_char_value.init_offs = 0;
    attr_char_value.max_len = sizeof(mod_ble_data_t);
    attr_char_value.p_value = NULL;

    err_code = sd_ble_gatts_characteristic_add(
        h_light_nvm_service, &char_md, &attr_char_value, &h_status_byte);
    APP_ERROR_CHECK(err_code);
    
    // Add Button characteristic.

    ble_gatts_char_md_t char_md1;
    ble_gatts_attr_md_t cccd_md1;
    ble_gatts_attr_t    attr_char_value1;
    ble_uuid_t          ble_uuid1;
    ble_gatts_attr_md_t attr_md1;
    uint8_t uuid1_type;

    /**** Create the BT Dongle service *****/
    ble_uuid128_t base_uuid1 = {{NOTIFY_UUID_COMPLETE}};
    err_code = sd_ble_uuid_vs_add(&base_uuid1, &uuid1_type);
    APP_ERROR_CHECK(err_code);


	memset(&cccd_md1, 0, sizeof(cccd_md1));

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md1.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md1.write_perm);
	cccd_md1.vloc       = BLE_GATTS_VLOC_STACK;

    memset(&char_md1, 0, sizeof(char_md1));

    char_md1.char_props.read   = 1;
    char_md1.char_props.notify = 1;
    char_md1.p_char_user_desc  = NULL;
    char_md1.p_char_pf         = NULL;
    char_md1.p_user_desc_md    = NULL;
    char_md1.p_cccd_md         = &cccd_md1;
    char_md1.p_sccd_md         = NULL;

	ble_uuid1.type = uuid1_type;
	ble_uuid1.uuid = NOTIFY_UUID_SERVICE;

    memset(&attr_md1, 0, sizeof(attr_md1));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md1.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attr_md1.write_perm);
    attr_md1.vloc       = BLE_GATTS_VLOC_STACK;
    attr_md1.rd_auth    = 0;
    attr_md1.wr_auth    = 0;
    attr_md1.vlen       = 0;

    memset(&attr_char_value1, 0, sizeof(attr_char_value1));

    attr_char_value1.p_uuid    = &ble_uuid1;
    attr_char_value1.p_attr_md = &attr_md1;
    attr_char_value1.init_len  = sizeof(mod_ble_data_t);
    attr_char_value1.init_offs = 0;
    attr_char_value1.max_len   = sizeof(mod_ble_data_t);
    attr_char_value1.p_value   = NULL;

    sd_ble_gatts_characteristic_add(h_light_notify_service, &char_md1, &attr_char_value1, &h_notify_byte);

}

void light_nvm_ble_gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(
        &sec_mode, (const uint8_t *)device_name, sizeof(device_name));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

void light_nvm_ble_adv_init()
{
    h_adv = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
    uint8_t scn_rsp_data[] = APP_SCAN_RSP_DATA;
    uint32_t err_code;
    ble_gap_adv_data_t adv_payload;
    

    adv_payload.adv_data.p_data = adv_data;
    adv_payload.adv_data.len = sizeof(adv_data);

    adv_payload.scan_rsp_data.p_data = scn_rsp_data;
    adv_payload.scan_rsp_data.len = sizeof(scn_rsp_data);
    
    ble_gap_adv_params_t adv_params;

    memset(&adv_params, 0, sizeof(adv_params));

    //Set channel 37, 38 and 39 as advertising channels
    memset(adv_params.channel_mask, 0, 5);

    //Set the advertising to timeout in 180s
    adv_params.duration = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;

    //Any device can scan request and connect
    adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;

    //Period between sending advertising packets
    adv_params.interval = ADVERTISING_INTERVAL;

    //Use 1Mbps physical layer to be backward compatible
    adv_params.primary_phy = BLE_GAP_PHY_1MBPS;

    //The advertisement would be unidirected connectable and scannable
    adv_params.properties.type =
            BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;

    adv_params.p_peer_addr = NULL;
    adv_params.scan_req_notification = 0;

    err_code = sd_ble_gap_adv_set_configure(&h_adv,
            (ble_gap_adv_data_t const *)&adv_payload,
            (ble_gap_adv_params_t const *) &adv_params);
    APP_ERROR_CHECK(err_code);
}

void light_nvm_ble_adv_start(void (*conn_func) (void), void (*disconn_func) ())
{
    connected_callback = conn_func;
    disconnected_callback = disconn_func;
    bluetooth_status = true;
    uint32_t err_code;
    err_code = sd_ble_gap_adv_start(h_adv, BLE_CONN_CFG_TAG_DEFAULT);
    APP_ERROR_CHECK(err_code);
}

bool light_nvm_is_bt_on ()
{
    return bluetooth_status;
}

void light_nvm_ble_update_status_byte(mod_ble_data_t * status_byte)
{
    uint32_t err_code;
    log_printf("Status byte : %d\n");
    ble_gatts_value_t val =
    {
        .len = sizeof(mod_ble_data_t),
        .offset = 0,
        .p_value =(uint8_t *) status_byte
    };
    err_code = sd_ble_gatts_value_set(h_conn,
            h_status_byte.value_handle, &val);
    APP_ERROR_CHECK(err_code);
    

}

void light_nvm_ble_notify (mod_ble_data_t * p_val)
{
    uint32_t err_code;
    uint16_t data_size = sizeof(mod_ble_data_t); 
    err_code = sd_ble_gatts_sys_attr_set(h_conn, NULL, 0, 0);
    APP_ERROR_CHECK(err_code);
    ble_gatts_hvx_params_t hvx_params = 
    {
        .handle = h_status_byte.value_handle,
        .p_data = (uint8_t *)p_val,
        .p_len = (uint16_t *)&data_size,
        .type = BLE_GATT_HVX_NOTIFICATION,
        .offset = 0,
    };
    ble_gatts_hvx_params_t hvx_params1 = 
    {
        .handle = h_notify_byte.value_handle,
        .p_data = (uint8_t *)p_val,
        .p_len = (uint16_t *)&data_size,
        .type = BLE_GATT_HVX_NOTIFICATION,
        .offset = 0,
    };
    err_code = sd_ble_gatts_hvx (h_conn, &hvx_params);
    if(err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }
    err_code = sd_ble_gatts_hvx (h_conn, &hvx_params1);
    if(err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }
}
